Revit 2026 API

# MacroManager Class

---

Manager object for the Macro modules of the application.

SystemObject Autodesk.Revit.DB.MacrosMacroManager

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MacroManager : IEnumerable<MacroModule>,
	IDisposable
```
```vb
Public Class MacroManager
	Implements IEnumerable(Of MacroModule), IDisposable
```
```cpp
public ref class MacroManager : IEnumerable<MacroModule^>,
	IDisposable
```
```fsharp
type MacroManager =
    class
        interface IEnumerable<MacroModule>
        interface IDisposable
    end
```

The MacroManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | The count. |
|  | Folder | The modules folder. |
|  | IsEnabled | Indicates if macros stored in this MacroManager are enabled. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddModule | Adds a MacroModule to the application. |
|  | Contains | Indicates the given module is a member of this collection. |
|  | Dispose | Releases all resources used by the MacroManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetApplicationMacroSecurityOptions | Gets the application macro security options. |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMacroManager | Gets the Macro manager from the application. |
|  | GetMacroManagerIterator | Returns a Macro manager iterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveModule | Removes a MacroModule. |
|  | SetApplicationMacroSecurityOptions | Sets the application macro security options. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Macros Namespace